=============
Basic Action
=============
( ) test

---

(action_list
  (action
    (state 
    	(not_started))
    (name)))

================
With Description
================
(x) long $ with description

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (description)))

================
With Priority
================
(x) priority !1

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (priority)))

===============
With Everything
===============
(x) priority and description $descriptions !1

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (description)
    (priority)))
