=============
Basic Action
=============
( ) test

---

(action_list
  (action
    (state 
    	(not_started))
    (name)))

================
With Description
================
(x) long $ with description

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (description)))

================
With Priority
================
(x) priority !1

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (priority)))

================
With Story
================
(x) story test *Parent Story

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (story)))

============
with context
============
(x) context test +test_context,another_context

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (context_list
    	(middle_context)
	(tail_context))))


===============
With Everything
===============
(x) priority and description $ descriptions !1 * Test Story +test_context,another-context

---


(action_list
  (action
    (state 
    	(completed))
    (name)
    (description)
    (priority)
    (story)
    (context_list
    (middle_context)
    (tail_context))))
