=============
Basic Action
=============
( ) test

---

(action_list
 (action
  (state 
   (not_started))
  (name)))

================
With Description
================
(x) long $ with description

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (description
  	(desc_icon))))

================
With Priority
================
(x) priority !1

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (priority
  	(priority_icon))))

================
With Story
================
(x) story test *Parent Story

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (story
  	(story_icon))))

============
with context
============
(x) context test +test_context,another_context

---

(action_list
 (action
  (state 
   (completed))
  (name)
  (context_list
   (context_icon)
   (middle_context
    (context_separator))
   (tail_context))))

============
with do-date
============
(x) context test @2019-01-01T12:01AMD120

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (do_date_or_time
   (do_date_icon)
   (date
    (year)
    (month)
    (day)
    (time
     (time_designator)
     (hour)
     (minute)
     (duration
      (duration_designator)))))))

===================
with completed date
===================
(x) context test %2019-01-01T12:01AM

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (completed_date
   (date
    (year)
    (month)
    (day)
    (time
     (time_designator)
     (hour)
     (minute))))))

===============
With Everything
===============
(x) priority and description 
$ descriptions 
!1 
* Test Story 
+test_context,another-context 
@2019-01-01T12:01AMD120
%2019-03-01T02:01AM

---


(action_list
 (action
  (state 
   (completed))
  (name)
  (description
   (desc_icon))
  (priority
   (priority_icon))
  (story
   (story_icon))
  (context_list
   (context_icon)
   (middle_context
     (context_separator))
   (tail_context))
  (do_date_or_time
   (do_date_icon)
   (date
    (year)
    (month)
    (day)
    (time
     (time_designator)
     (hour)
     (minute)
     (duration
      (duration_designator)))))
     (completed_date
   (date
    (year)
    (month)
    (day)
    (time
     (time_designator)
     (hour)
     (minute))))))
